INSERT INTO SIN_TABLE
VALUES(
    100101,1,'LCB 수감자',0,1,
    208,4,8,-2,
    2,-1,0,
    '쳐내기', 5,1,0,1,4,7,
    '밀어찌르기', 7,2,0,2,4,4,
    '연격', 3,1,0,3,6,2,
    '가드', 5,1,-2,1,7,3,
    '정보전달', 1,5,NULL,2,4,NULL,
    '정보중화', 1,5,NULL,1,4,NULL,
    '림버스 컴퍼니, LCB',
    '침잠'
);

INSERT INTO SIN_TABLE
VALUES(
    200101,2,'LCB 수감자',0,1,
    244,2,4,+1,
    2,-1,0,
    '내려베기', 6,3,-1,1,4,7,
    '올려베기', 3,3,-1,2,5,4,
    '후벼찌르기', 4,2,-1,2,7,2,
    '회피', 6,2,+1,1,2,10,
    '분석', 1,6,NULL,2,2,NULL,
    '관찰', 1,6,NULL,1,3,NULL,
    '림버스 컴퍼니, LCB',
    NULL
);

INSERT INTO SIN_TABLE
VALUES(
    300101,3,'LCB 수감자',0,1,
    191,3,6,-2,
    0,-1,2,
    '찌르기', 2,2,2,1,4,7,
    '모아 찌르기', 7,2,2,1,4,12,
    '정의를 위해!', 4,2,2,3,3,3,
    '회피', 2,2,-2,1,2,10,
    '정의의 응징', 1,2,NULL,2,3,NULL,
    '응원', 1,2,NULL,1,5,NULL,
    '림버스 컴퍼니, LCB',
    '출혈'
);

INSERT INTO SIN_TABLE
VALUES(
    400101,4,'LCB 수감자',0,1,
    191,3,6,-4,
    -1,0,2,
    '칠하기', 4,1,2,1,4,7,
    '흩뿌리기', 2,1,2,2,4,5,
    '그려내기', 6,1,2,3,5,3,
    '회피', 4,2,-2,1,2,10,
    '무차별적 예술', 1,4,NULL,2,3,NULL,
    '등떠밀기', 1,4,NULL,2,3,NULL,
    '림버스 컴퍼니, LCB',
    '호흡'
);

INSERT INTO SIN_TABLE
VALUES(
    500101,5,'LCB 수감자',0,1,
    261,2,3,3,
    0,2,-1,
    '원, 투', 3,3,-3,2,3,4,
    '주먹꽂기', 6,3,-3,1,6,9,
    '연격', 5,3,-3,4,4,2,
    '가드', 3,1,+3,1,10,3,
    '각오', 1,3,NULL,1,2,NULL,
    '등뒤 받쳐주기', 1,3,NULL,1,3,NULL,
    '림버스 컴퍼니, LCB',
    '진동'
);

INSERT INTO SIN_TABLE
VALUES(
    600101,6,'LCB 수감자',0,1,
    191,3,6,-2,
    2,0,-1,
    '내려베기', 6,3,2,1,4,7,
    '이연격', 3,1,2,2,4,4,
    '선풍', 2,3,2,2,6,4,
    '회피', 3,2,-2,1,2,10,
    '유희', 1,3,NULL,2,2,NULL,
    '실없는 농담', 1,3,NULL,1,5,NULL,
    '림버스 컴퍼니, LCB',
    '침잠, 파열'
);

INSERT INTO SIN_TABLE
VALUES(
    700101,7,'LCB 수감자',0,1,
    226,2,5,0,
    2,0,-1,
    '배트 치기', 7,3,0,1,4,7,
    '내려박기', 1,3,0,2,4,4,
    '분풀기', 2,3,0,2,4,8,
    '반격', 7,3,0,1,7,4,
    '르쌍티망', 1,7,NULL,2,4,NULL,
    '악에 받친', 1,7,NULL,1,5,NULL,
    '림버스 컴퍼니, LCB',
    '진동'
);

INSERT INTO SIN_TABLE
VALUES(
    800101,8,'LCB 수감자',0,1,
    226,5,8,0,
    2,0,-1,
    '강타', 1,3,-1,1,4,7,
    '슬라이딩', 4,3,-1,1,6,9,
    '방어', 5,3,-1,1,8,12,
    '가드', 1,1,0,1,7,3,
    '발악', 1,1,NULL,1,3,NULL,
    '살아남고 말것이라는 마음', 1,1,NULL,1,6,NULL,
    '림버스 컴퍼니, LCB',
    '진동'
);

INSERT INTO SIN_TABLE
VALUES(
    900101,9,'LCB 수감자',0,1,
    226,2,5,0,
    -1,2,0,
    '내려찍기', 4,1,0,1,4,7,
    '연속 베기', 6,1,0,2,4,4,
    '처단', 1,1,0,4,4,2,
    '반격', 1,3,0,1,7,4,
    '단악', 1,1,NULL,1,5,NULL,
    '도박사', 1,1,NULL,1,5,NULL,
    '림버스 컴퍼니, LCB',
    '출혈'
);

INSERT INTO SIN_TABLE
VALUES(
    1100101,11,'LCB 수감자',0,1,
    174,3,7,-4,
    -1,2,0,
    '내려베기', 6,1,3,1,4,7,
    '연속 베기', 1,1,3,3,4,2,
    '헤집어 베기', 7,1,3,3,5,3,
    '반격', 6,3,3,1,7,4,
    '각오', 1,6,NULL,1,3,NULL,
    '앙심', 1,6,NULL,1,3,NULL,
    '림버스 컴퍼니, LCB',
    '파열'
);

INSERT INTO SIN_TABLE
VALUES(
    1200101,12,'LCB 수감자',0,1,
    174,3,7,-4,
    -1,0,2,
    '칼날 빼기', 3,2,3,3,3,2,
    '배후 베기', 6,1,3,2,5,4,
    '뚫어내기', 5,2,3,1,7,14,
    '회피', 3,2,-3,1,2,10,
    '처형', 1,3,NULL,1,4,NULL,
    '군인정신', 1,3,NULL,1,5,NULL,
    '림버스 컴퍼니, LCB',
    '파열'
);

INSERT INTO SIN_TABLE
VALUES(
    1300101,13,'LCB 수감자',0,1,
    208,3,7,0,
    0,-1,2,
    '베기', 5,1,-1,1,4,7,
    '후비기', 4,2,-1,1,5,10,
    '썰어내기', 3,2,-1,2,6,4,
    '가드', 5,1,0,1,8,3,
    '강제생존', 1,5,NULL,1,3,NULL,
    '인자 코드 G-0', 1,5,NULL,1,3,NULL,
    '림버스 컴퍼니, LCB',
    '파열'
);


COMMIT;

SELECT * FROM SIN_TABLE;